class TestArraysClass
{
    static void Main()
    {
        // Описание объекта типа массив
        int[] array0;
        // Выделение места под массив
        array0 = new int[5];
        // Объявление одномерного массива из 5 элементов
        int[] array1 = new int[5];
        // Объявление массива и заполнение его элементами
        int[] array2 = new int[] { 1, 3, 5, 7, 9 };
        // Альтернативный вариант создания заполненного массива
        int[] array3 = { 1, 2, 3, 4, 5, 6 };

    }
}
